1password
1password-cli
aerospace
airbuddy
alfred
amazon-chime
anaconda
anythingllm
apparency
appcleaner
audio-hijack
avast-security
background-music
balenaetcher
bartender
betterdisplay
bettertouchtool
blank-screensaver
box-tools
calibre
chromedriver
coteditor
disk-drill
docker
dropbox
emacs-mac
fing
fission
flux
focus
font-awesome-terminal-fonts
font-courier-new
font-courier-prime
font-courier-prime-code
font-courier-prime-medium-and-semi-bold
font-courier-prime-sans
font-et-book
font-exo-2
font-fontawesome
font-michroma
font-montserrat
font-montserrat-alternates
font-montserrat-subrayada
font-ocr
font-orbitron
font-ultra
glance
google-chrome
google-drive
handbrake
hyperkey
iina
intellij-idea-ce
jan
karabiner-elements
keka
keyboardcleantool
keycastr
kitty
little-snitch
lm-studio
loopback
mac-mouse-fix
macfuse
mactex-no-gui
maestral
micro-snitch
microsoft-auto-update
microsoft-edge
microsoft-office
microsoft-teams
msty
muzzle
notunes
obsidian
openin
oracle-jdk
parallels
parallels-toolbox
pearcleaner
photosweeper-x
popclip
pycharm-ce
qlcolorcode
qlimagesize
qlmarkdown
qlstephen
qlvideo
quicklook-json
quicklookase
r
raspberry-pi-imager
rstudio
secretive
selfcontrol
shottr
signal
skim
skype
slack
soundsource
spotify
suspicious-package
swish
tg-pro
tigervnc-viewer
topnotch
typora
visual-studio-code
viz
vlc
webstorm
whatsapp
zed
zoom
