tap "ajayrmk/tap"
tap "codeforreal1/tap"
tap "f/mcptools"
tap "felixkratz/formulae"
tap "graelo/tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "virtuslab/scala-cli"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# C++ template library for linear algebra
brew "eigen"
# GNU compiler collection
brew "gcc"
# Optimized BLAS library
brew "openblas"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Cross-platform make
brew "cmake"
# Create and run Linux containers using lightweight virtual machines
brew "container", link: false
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# Client library for huggingface.co hub
brew "hf"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# LLM inference in C/C++
brew "llama.cpp"
# Git-native dotfiles management that doesn't suck
brew "lnk"
# Simple markdown translator
brew "lowdown"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Scala language server
brew "metals"
# Lightweight PDF and XPS viewer
brew "mupdf-tools"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Perl compatible regular expressions library
brew "pcre"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Static type checker for Python
brew "pyright"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Markdown Linter and Formatter written in Rust
brew "rumdl"
# Safe, concurrent, practical language
brew "rust"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Command-line tool to interact with Scala
brew "virtuslab/scala-cli/scala-cli"
# Software for mathematics, science, and engineering
brew "scipy"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Terminal multiplexer
brew "tmux"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Lightweight BitTorrent client
brew "transmission-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Offline meeting transcription for macOS — auto-detects meetings, transcribes locally, saves to Claude Desktop via MCP
brew "ajayrmk/tap/trnscrb"
# Command-line interface for interacting with MCP (Model Context Protocol) servers
brew "f/mcptools/mcp"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Power Usage Monitor for Apple Silicon
brew "graelo/tap/pumas"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AirPods companion app
cask "airbuddy"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Temporary notes with calculations and extensible features
cask "antinote"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Records audio from any application
cask "audio-hijack"
# Antivirus software
cask "avg-antivirus"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Utility to create and modify archives
cask "betterzip"
# E-books management software
cask "calibre"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# Compress any video/image into a tiny size
cask "codeforreal1/tap/compresso"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Data recovery software
cask "disk-drill"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
cask "railwaycat/emacsmacport/emacs-mac"
# Audio editor
cask "fission"
# Screen colour temperature controller
cask "flux-app"
cask "font-ark-pixel-10px-monospaced"
cask "font-ark-pixel-10px-proportional"
cask "font-ark-pixel-12px-monospaced"
cask "font-ark-pixel-12px-proportional"
cask "font-ark-pixel-16px-monospaced"
cask "font-ark-pixel-16px-proportional"
cask "font-atkinson-hyperlegible-next"
cask "font-cardo"
cask "font-cascadia-code-nf"
cask "font-charter"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-medium-and-semi-bold"
cask "font-courier-prime-sans"
cask "font-eb-garamond"
cask "font-et-book"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
cask "font-ibm-plex-sans-jp"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-michroma"
cask "font-new-computer-modern"
cask "font-ocr"
cask "font-routed-gothic"
cask "font-stix-two-math"
cask "font-stix-two-text"
cask "font-ultra"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake-app"
# Free and open-source media player
cask "iina"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope@3"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Open-source keystroke visualiser
cask "keycastr"
# GPU-based terminal emulator
cask "kitty@nightly"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Host-based application firewall
cask "little-snitch"
# Discover, download, and run local LLMs
cask "lm-studio"
# Cable-free audio router
cask "loopback"
# Trims video and audio files losslessly
cask "losslesscut"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# File system integration
cask "macfuse"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Speech recognition tool
cask "macwhisper"
# Monitors and reports any microphone and camera activity
cask "micro-snitch"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open links/files with specific browsers/apps
cask "openin"
# JDK from Oracle
cask "oracle-jdk"
# Desktop virtualization software
cask "parallels"
# Bundle with over 30 tools
cask "parallels-toolbox"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Tool to eliminate similar or duplicate photos
cask "photosweeper-x"
# Audio recording application
cask "piezo"
# Used to access context-specific actions when text is selected
cask "popclip"
# VPN client focusing on security
cask "protonvpn"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Environment for statistical computing and graphics
cask "r-app"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Data science software focusing on R and Python
cask "rstudio"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Menu bar indicator showing the currently selected space
cask "spaceid"
# Video game digital distribution service
cask "steam"
# Application for inspecting installer packages
cask "suspicious-package"
# Quicklook extension for source files
cask "syntax-highlight"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Multi-platform VNC client and server
cask "tigervnc"
# Open-source BitTorrent client
cask "transmission"
# Configurable document editor that supports Markdown
cask "typora"
# Utility for extracting text from images, videos, QR codes and barcodes
cask "viz"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "AutoMute", id: 1118136179
mas "Barbee", id: 1548711022
mas "ColorSlurp", id: 1287239339
mas "DaisyDisk", id: 411643860
mas "Dark Reader for Safari", id: 1438243180
mas "Dato", id: 1470584107
mas "Deliveries", id: 290986013
mas "djay Pro", id: 450527929
mas "Drafts", id: 1435957248
mas "Dropover", id: 1355679052
mas "F5Access", id: 1243219105
mas "iA Presenter", id: 6746414429
mas "iA Writer", id: 775737590
mas "Just Press Record", id: 1033342465
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "PastePal", id: 1503446680
mas "Peek", id: 1554235898
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "QR Pop", id: 1587360435
mas "Reeder", id: 1529448980
mas "Square Sketch", id: 6477753172
mas "Tadam", id: 531349534
mas "Things", id: 904280696
mas "Xcode", id: 497799835
