tap "felixkratz/formulae"
tap "homebrew/cask"
tap "homebrew/core"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "virtuslab/scala-cli"
brew "aria2"
brew "black"
brew "blueutil"
brew "btop"
brew "glib"
brew "cloc"
brew "cmake"
brew "conan"
brew "coreutils"
brew "gcc"
brew "openblas"
brew "dlib"
brew "docker", link: false
brew "docker-machine", restart_service: :changed
brew "dvc"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "gdrive"
brew "gh"
brew "ghostscript"
brew "gifski"
brew "go"
brew "gobject-introspection"
brew "handbrake", link: false
brew "htop"
brew "huggingface-cli"
brew "imagemagick"
brew "jq"
brew "keychain"
brew "libmagic"
brew "llama.cpp"
brew "mas"
brew "metals"
brew "mosh"
brew "node"
brew "nvtop"
brew "ollama", restart_service: :changed
brew "pytorch"
brew "openai-whisper"
brew "pandoc"
brew "pnpm"
brew "poetry"
brew "portaudio"
brew "prettier"
brew "python@3.10"
brew "python@3.9"
brew "rust"
brew "sbt"
brew "scala"
brew "subversion"
brew "texlab"
brew "tmux"
brew "wget"
brew "yt-dlp"
brew "zsh"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "virtuslab/scala-cli/scala-cli"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "airbuddy"
cask "alfred"
cask "anaconda"
cask "apparency"
cask "appcleaner"
cask "audio-hijack"
cask "avast-security"
cask "balenaetcher"
cask "bartender"
cask "betterdisplay"
cask "bettertouchtool"
cask "box-tools"
cask "calibre"
cask "chromedriver"
cask "claude"
#cask "claude-code"
cask "coteditor"
cask "disk-drill"
cask "docker-desktop"
cask "dropbox"
cask "emacs-mac"
cask "fission"
cask "flux-app"
cask "focus"
cask "font-awesome-terminal-fonts"
cask "font-courier-new"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-medium-and-semi-bold"
cask "font-courier-prime-sans"
cask "font-et-book"
cask "font-exo-2"
cask "font-fontawesome"
cask "font-michroma"
cask "font-montserrat"
cask "font-montserrat-alternates"
cask "font-montserrat-subrayada"
cask "font-ocr"
cask "font-orbitron"
cask "font-ultra"
cask "google-chrome"
cask "google-drive"
cask "handbrake-app"
cask "iina"
cask "jan"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keka"
cask "keyboardcleantool"
cask "kitty"
cask "little-snitch"
cask "lm-studio"
cask "loopback"
cask "mac-mouse-fix"
cask "macfuse"
cask "mactex-no-gui"
cask "micro-snitch"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "muzzle"
cask "notunes"
cask "obsidian"
cask "oracle-jdk"
cask "parallels"
cask "parallels-toolbox"
cask "pearcleaner"
cask "photosweeper-x"
cask "popclip"
cask "pycharm-ce"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "r-app"
cask "raspberry-pi-imager"
cask "rstudio"
cask "shottr"
cask "signal"
cask "skim"
cask "slack"
cask "soundsource"
cask "spotify"
cask "suspicious-package"
cask "tg-pro"
cask "tigervnc-viewer"
cask "typora"
cask "visual-studio-code"
cask "viz"
cask "vlc"
cask "whatsapp"
cask "zed"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "AutoMute", id: 1118136179
mas "Bear", id: 1091189122
mas "ColorSlurp", id: 1287239339
mas "ControllerForHomeKit", id: 1198176727
mas "DaisyDisk", id: 411643860
mas "Dark Reader for Safari", id: 1438243180
mas "Dato", id: 1470584107
mas "Deliveries", id: 290986013
mas "Drafts", id: 1435957248
mas "Dropover", id: 1355679052
mas "Enchanted", id: 6474268307
mas "F5Access", id: 1243219105
mas "Focus Matrix", id: 1087284172
mas "Gifski", id: 1351639930
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Messenger", id: 1480068668
#mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "OpenIn", id: 1643649331
mas "Pages", id: 409201541
mas "PastePal", id: 1503446680
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Tadam", id: 531349534
mas "Things", id: 904280696
mas "Xcode", id: 497799835
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "grapecity.gc-excelviewer"
vscode "iamhyc.overleaf-workshop"
vscode "james-yu.latex-workshop"
vscode "matangover.mypy"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "twxs.cmake"
vscode "valentjn.vscode-ltex"
